Tekla Open API Reference for Tekla Structures 2025
ControlArc Properties
The ControlArc type exposes the following members.
Properties
Name | Description
Color
 Gets or sets color of the control arc.
Geometry
 Gets or sets the arc geometry. The arc must not represent a complete circle (i.e. the arc angle must be less than 360 degrees).
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
LineType
 The line type of the control arc.
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Top
See Also
Reference
ControlArc Class
Tekla.Structures.Model Namespace